Revit 2026 API

# WorksharingUtilsCheckoutWorksets(Document, ISetWorksetId, TransactWithCentralOptions) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<WorksetId> CheckoutWorksets(
	Document document,
	ISet<WorksetId> worksetsToCheckout,
	TransactWithCentralOptions options
)
```
```vb
Public Shared Function CheckoutWorksets (
	document As Document,
	worksetsToCheckout As ISet(Of WorksetId),
	options As TransactWithCentralOptions
) As ISet(Of WorksetId)
```
```cpp
public:
static ISet<WorksetId^>^ CheckoutWorksets(
	Document^ document,
	ISet<WorksetId^>^ worksetsToCheckout,
	TransactWithCentralOptions^ options
)
```
```fsharp
static member CheckoutWorksets :
        document : Document *
        worksetsToCheckout : ISet<WorksetId> *
        options : TransactWithCentralOptions -> ISet<WorksetId>
```

#### Parameters

document Document

worksetsToCheckout ISetWorksetId

options TransactWithCentralOptions

#### Return Value

ISetWorksetId

#### Reference

WorksharingUtils Class

CheckoutWorksets Overload

Autodesk.Revit.DB Namespace